[
  "In frst-person shooters (FPS), one of the most representative genres of e-sports, players require a high level of gaming combat skills to compete.",
  "Such skills include the ability to accurately shoot small, fast-moving enemies, incapacitate an enemy attack through unpredictable movement, and create a more manageable shooting situation in the game than the enemy.",
  "These skills are not easily acquired through short-term exercises and thus have been regarded as part of successful FPS players’ core competitiveness.",
  "Professional FPS players have overwhelming gaming combat skills compared to amateur players.",
  "In gaming communities worldwide, these professional players are often called Gosu, a Korean term meaning a highly skilled person, and they are revered for their dominating performance.",
  "However, our understanding of FPS players’ gaming combat skills remains at initial level.",
  "Understanding the mechanisms through which professional FPS players can gain overwhelming gaming combat skills is an essential issue in e-sports science.",
  "It enables more credible player training and player trading, and as a result, like traditional sports, e-sports can be taken seriously.",
  "Typically, the gaming physical combat skills of FPS players have primarily been measured using in-game statistics, such as the kill/death ratio or average damage per game.",
  "Such aggregated metrics only confrm the consequential and straightforward fact that a particular player is superior to other players and cannot tell us how the player performs better.",
  "Various online communities have speculated on the secrets behind the performance of professional FPS players.",
  "Typically, the conjectures include how professional players aim, move, or what type of devices to use.",
  "More specifcally, one conjecture states that fring a weapon with a single or short burst of controlled clicks (called tapping) or aiming a target with the arm instead of the wrist is efective for higher performance.",
  "Another conjecture is that a player should make unpredictable movements, combined with jumping and crouching.",
  "However, these conjectures have not been scientifcally verifed, and credible training guides for amateur players are virtually nonexistent.",
  "Consequently, amateur FPS players subjectively analyze professional players’ play videos and follow CHI ’21, May 8–13, 2021, Yokohama, Japan input devices used by professional players.",
  "Moreover, many of them © 2021",
  "Copyright held by the owner/author(s).",
  "Publication rights licensed to ACM.",
  "practice with community-suggested shooting training programs, ACM ISBN 978-1-4503-8096-6/21/05. . .",
  "$15.00 https://doi.org/10.1145/3411764.3445217 such as Aim Hero,1",
  "Aim Lab,2 and KovaaK 2.0,3 which have not proven efective.",
  "This study quantitatively compares professional and amateur FPS players’ performance to solve this problem and confrms whether famous conjectures on the web are correct.",
  "First, we selected conjectures from sources such as the ofcial blogs of companies developing FPS related software and YouTube videos with least 100,000 to over 2,000,000 views.",
  "Then, we fltered those that can be commonly applied to general FPS games.",
  "We excluded those that depend on the game (e.g., “Hide behind the second box in that map”) or are difcult to quantify (e.g., “Do image training on shooting situation”).",
  "Table 1 summarizes the conjectures for the current study.",
  "Our goal is to verify these conjectures scientifcally and to fulfll the desired knowledge of amateur FPS players.",
  "To achieve the goal, we devised 15 quantitative performance metrics that compare professional and amateur players in the following four aspects of FPS play: aiming, character’s movement, physical skills, and device and settings.",
  "Furthermore, we built a comprehensive gameplay logging system that can measure the proposed metrics in Counter Strike: Global Offensive (CS:GO), a popular commercial FPS game.",
  "The system can log data from six behavioral sensors (i.e., eye tracker, motion capture, dual-sensor mouse, Wooting analog keyboard, heartbeat sensor, and an electromyography (EMG) sensor) and data from in-game situations during gameplay.",
  "The timestamps between the sensors are synchronized with high accuracy and precision.",
  "We recruited eight professional FPS players and eight amateur players and measured their performance with our logging system as they played CS:GO.",
  "Each group played against another player within the same group to create a general gameplay situation.",
  "By analyzing the resulting data set with the proposed metrics, we revealed that only 6 out of 13 of the conjectures are supported by statistically signifcant evidence.",
  "Finally, the contributions of this study can be summarized as follows: •",
  "We surveyed conjectures on the web about FPS performance and summarized them into four specifc categories.",
  "•",
  "We developed an advanced gameplay logging system that can measure signals from six behavioral sensors and in-game situations with synchronized timestamps.",
  "• We present 15 quantitative performance metrics that can scientifcally evaluate the conjectures of FPS performance.",
  "•",
  "We verifed the conjectures on the web based on the proposed metrics.",
  "•",
  "We presented the collected dataset to the public for future research 4.",
  "The quantitative evaluation of athletic performance is considered essential in all sports genres.",
  "It aids both in-game and out-of-game decision-making for coaches, clubs, and athletes.",
  "It also provides clues to improve athletic performance on individual and team levels.",
  "Sports fans also are interested in such data interpretation.",
  "1 Aim Hero, ProGames Studio, 2016 2Aim Lab, Statespace, 2018 3KovaaK 2.0, The Meta, 2018 4http://leebyungjoo.com/secrets-of-gosu",
  "Stoltz argued that, as the movement of sabermetrics in baseball expands, audiences who search for new baseball knowledge have increased correspondingly, creating a new era of baseball experience.",
  "Other studies have found that the presentation and visualization of such data lead to a better understanding of the game and increase engagement and excitement concerning the game experience for sports and e-sports fans..",
  "For similar reasons, performance measurements and analyses in e-sports are crucial, particularly considering that the data generated from e-sports are comparable to even the most data-rich traditional sports, such as Formula One.",
  "Moreover, e-sports can be classifed into several representative genres, such as Real-Time Strategy (RTS), Multiplayer Online Battle Arena (MOBA), and FPS games.",
  "Each of these genres usually has diferent quantitative metrics for player performance.",
  "For instance, MOBA games typically require active collaborations and efcient communication.",
  "As a result, statistics, such as kill death assist (KDA) per game or wards purchase (WA) per game, are often used for quantitative metrics.",
  "In addition, KDA is calculated as the addition of the number of kills and assists divided by the number of deaths, and WP measures the number of ward purchases.",
  "Moreover, RTS games demand a high level of multitasking abilities and use Actions Per Minute (APM) or Efective Actions Per Minute (EAPM) as the quantitative measurement of player performance, measured by the number of actions, such as keyboard inputs and mouse clicks, created by the player in a minute.",
  "However, an FPS game requires players to kill fast-moving enemies.",
  "Therefore, they typically use quantitative measurements, such as the Kill/Death Ratio (KDR), Average Damage Per Game (ADG), or Headshot Percentage (HS%).",
  "KDR is measured by the number of kills over the number of deaths in a game and ADG is measured by the amount of damage to enemies in a game.",
  "HS% is measured by the percentage of headshots in a game.",
  "For the quantitative approach to an FPS game, several studies have suggested implicit measures that can represent a player’s skills that are not ofcially given from the game.",
  "In an FPS game called Red Eclipse, Buckley et al. found that various keyboard input events, such as the average and the total number of keys pressed or the number of keys pressed at once, demonstrated a higher prediction of skill level than mouse input events, such as the number of clicks.",
  "Other studies on keyboard and mouse input have also shown that measurements, such as the time spent holding a specifc key or the total mouse distance moved, can also explain the skills of an FPS player.",
  "To characterize the skill level of players in CS:GO, Velichkovsky et al. employed eye gaze data, especially the analysis of the fxation duration on the computer screen.",
  "They found that professional players generated higher frequencies of a longer fxation duration than amateur players.",
  "Beyond the proposal of measurements on single behavioral data, some researchers have proposed a particular system that can monitor and measure player behavior and in-game data in an integrated way in an FPS game.",
  "In CS:GO, Korotin et al. proposed a system that can comprehensively measure the player’s gaze, keyboard input, mouse input, heart rate, and in-game data.",
  "Stepanov et al. extended the previous system by adding a few more sensors, including galvanic skin response sensor, EMG, and inertial measurement unit sensor.",
  "They proposed a technique to maintain synchronization between sensors within 10 ms of temporal accuracy.",
  "However, the contributions of these studies focused on designing a measurement system.",
  "Some studies aimed to analyze the skills of FPS players qualitatively.",
  "From a video analysis of gameplays, Reeves et al. found that expert FPS players tend to deceive their positions and take clever sidesteps to make it difcult for the opponent to shoot or frequently sit while shooting to increase shooting accuracy.",
  "Fanfarelli interviewed professional players from Overwatch, a popular FPS game, to identify the critical elements of FPS skills, as follows: survival, anticipation/prediction, communication, thoughtfulness, aim, ability usage, movement and positioning, and team-based mechanical synergy.",
  "In addition, Fanfarelli mentioned that most game genres require these elements, but especially in FPS, the mechanics covering the aiming ability are considered essential for expertise in FPS play.",
  "Witkowski emphasized the kinesthetic ability in e-sports through a qualitative study that interviewed CounterStrike players and organizers at the three e-sports tournaments:",
  "Games.",
  "To summarize, many previous studies have analyzed diferent genres of e-sports from diverse perspectives.",
  "Among the various genres, the FPS has frequently been used as the research subject due to its versatile and dynamic environment.",
  "However, many research questions from previous studies are diferent from what actual gamers want to know.",
  "In this study, we aim to bridge the gap between the researchers and gamers by validating conjectures from online gaming communities.",
  "Our fndings present a greater external validity than previous studies by analyzing a comprehensive dataset collected from the gameplay between professional and amateur FPS players.",
  "To verify the conjectures in Table 1, we experimented with an uncontrolled FPS game playing situation to collect realistic gameplay data from players.",
  "We chose CS:GO for the FPS gameplay because of its global popularity and abundant open sources.",
  "We aimed to record various types of physical performance of the players during an actual gameplay situation.",
  "To this end, we developed a gameplay logging system consisting of six external sensors and an in-game data logger.",
  "In this section, we describe the implementation of the logging system.",
  "In the system, the six external sensors collect user behavioral data, and the in-game logger exploited the internal game parameters through a Dynamic Link Library (DLL)-injection attack (Figure 1).",
  "We devised the loggerslate to begin or halt the logging process by sending a User Datagram Protocol (UDP) packet to all six external sensors simultaneously.",
  "When we turn on the system, loggerslate sends a wake signal to the local-time stamper, motion-capture sensor, and analog input keyboard, and the three systems record the epoch time obtained from the system clock of the Operating System (OS).",
  "To reduce the operational burden on the OS and minimize the asynchrony between the timestamps of each sensor, the four sensors (dual-sensor mouse, eye tracker, EMG sensor, and pulse sensor) receive the local time from the local-time stamper and record the local time using a diferent frequency for each sensor.",
  "The local time is set to zero when the local-time stamper receives the wake signal from the loggerslate, and the resolution of the local time is 1 ms.",
  "The global timestamps of the four sensors are acquired by adding the local time to the epoch time recorded when the local-time stamper frst receives the wake signal.",
  "3.1.1 Dual-sensor mouse.",
  "We fabricated a mouse device for our study by adopting a dual-sensor mouse.",
  "We collected the length, width, and height of the mice used by 255 professional players from prosettings.net and designed a mouse according to the average size.",
  "The resulting dimensions resemble the Logitech G Pro Wireless mouse.",
  "The dual sensors of the mouse allow measuring the rotation angle and clutching duration of the mouse.",
  "We can also control the virtual sensor position using the two static optical sensors, but the virtual sensor position was fxed at the center of the mouse in this study.",
  "The device polling rate was set at 500 Hz, and the sensor resolution was set to 12k dots per inch (dpi) internally and was downsampled to a user-defned dpi.",
  "The dual-sensor mouse data include a timestamp in milliseconds and microseconds, dx and dy of the front and rear sensors in counts, dx and dy of the cursor in pixels (px), and button states, such as left or right clicks.",
  "The rotation angle and clutching duration were calculated from these data afterward.",
  "3.1.2 Analog input keyboard.",
  "We used a Wooting One analog input keyboard, which can detect can detect the gradual movement of each key like a joystick, which enables logging how far the user presses down.",
  "It is connected via a universal serial bus (USB), and the data were logged through the Wooting Keyboard Library.",
  "The analog input keyboard data include a timestamp in milliseconds, the pressed key, and pressed depth of the key as an integer with the range from 0 to 231.",
  "3.1.3 Motion-capture sensor.",
  "We used the OptiTrack three dimensional (3D) position tracking system for real-time position tracking of the objects attached with specialized refective markers.",
  "Our system consists of eight high-speed tracking cameras and the motion-capture software MOTIVE.",
  "OptiTrack cameras were connected using Cat 6 Ethernet connections to the OptiTrack switch for data consolidation and power distribution.",
  "The switch sends UDP packets with the position and orientation data for each marker.",
  "The resolution of the marker displacement is accurate to 1-mm under a sampling rate of 240 Hz.",
  "The data of the motion-capture sensors includes the timestamp in milliseconds; frame number; marker ID in integers; x ,y, z coordinates; and marker diameter.",
  "When the marker is added, ID; x ,y, z coordinates; and diameter for each marker are added to the data column.",
  "3.1.4 Eye tracker.",
  "We used the SMI REDn Scientifc System, with iViewRED software as a monitor-mounted eye-tracking system in this work.",
  "The eye tracker requires a calibration process for each user to establish the relationship between the eye position in the camera view and the gaze point in space.",
  "We performed a fve-point calibration each time we started logging.",
  "The eye tracker data include the timestamp in milliseconds, x , y coordinates of both the left and right eye staring at the gaze point, and the diameter of each pupil.",
  "3.1.5 EMG sensor.",
  "We also used the MYO armband consisting of eight EMG sensors and nine axis IMUs.",
  "The MYO armband was worn on the forearm below the elbow.",
  "The intuitive sensor logging system receives data from the MYO armband via Bluetooth 4.0.",
  "The sampling frequencies are 50 Hz for the IMU and 200 Hz for the EMG.",
  "The data from the MYO armband include the timestamp in milliseconds and data from the eight EMG sensors.",
  "From the IMU, the orientation (row, pitch, and yaw) data in radians, three-axis accelerometer data in G, and gyroscope data in G are logged.",
  "The operating and calibration status and whether the band is worn on the left or right arm were also recorded.",
  "3.1.6 Pulse sensor.",
  "We used a Grove ear-clip heart-rate sensor attached to an Arduino UNO.",
  "The ear-clip contains an optical sensor to monitor the heart rate of users at 500 Hz.",
  "The pulse sensor data include the timestamp in milliseconds, beats per minute (BPM), inter beat interval (IBI), and signal (SIG).",
  "We devised an in-game data logger to obtain detailed in-game data, such as character location, fred weapons, health, and more.",
  "We modifed Osiris, an open-source pure C++ CS:GO internal cheat by DLL injection to extract the data from memory.",
  "We used the epoch time as the timestamp for the in-game data to synchronize the time with other sensors.",
  "First, when the system starts to work, the system records the start time (the local time of the machine) in epoch time using the GetSystemTimeAsFileTime.",
  "Then, we used a hardware performance counter to measure the elapsed time more precisely.",
  "The counter has a high resolution and can be used as an accurate timer.",
  "The fnal timestamp was calculated by adding QueryPerformanceFrequency divided by QueryPerformanceCounter to the start time.",
  "3.2.1 Player data.",
  "To collect the player data coordinated with the player’s viewpoint, we employed the paintTraverse function from the CS:GO game engine, which iterates over entities in the game.",
  "We added a logger hooked into paintTraverse function because every entity will be already drawn to the screen before the paintTraverse is called.",
  "As paintTraverse is called by the game engine every frame, the logger collects the player’s data listed below by iterating all of the entities existing in the interface.",
  "We logged four player data items: player information, the current 3D position of the player, and the enemy player’s skeletal position and visibility.",
  "Player information includes the players and their opponents’ names and health points between 0 and 100.",
  "The current player’s 3D position includes the x, y, and z 3D coordinates.",
  "The opponents’ skeletal data include the x and y 2D coordinates based on the screen resolution (1920 x 1080).",
  "Because we only need the general shape of a character’s body, the logger records 19 positions out of 85: seven bones from the spine (from the head to the pelvis), six bones for the left and right arms (three bones each), and six bones for the left the visibility of the enemy player’s skeletal position based on the current player’s viewpoint, where 0 is invisible, and 1 is visible.",
  "3.2.2 Game events.",
  "The game engine generates events for broadcasting various character actions.",
  "By placing the event listener for specifc target events, the logger can manage these events and logs as the events arise.",
  "We logged six items for game events: player death, weapon fre, weapon reload, weapon zoom, player spawn, and player jump.",
  "When each event occurs, the name of the player who generates the event is logged.",
  "When a player death event occurs, the dead player’s name and whether it was a headshot are also logged.",
  "3.2.3 Output format.",
  "The logger saves these data into CSV format.",
  "The rows contain a timestamp and either player data or game events.",
  "For player data, the timestamp, current player’s name, health points, weapon type, and 3D position are shown frst.",
  "Then, the enemy’s name, health point, and each of the 19 2D skeletal positions with visibility status are shown.",
  "With the developed logging system, 16 FPS players (eight amateurs and eight professionals) participated in the data collection.",
  "Each player performed a 30-minute gameplay session against another player within the same expertise group while collecting data.",
  "According to their performance level, we recruited 16 participants from the following two groups: a professional player group and an amateur player group.",
  "For the professional player group, eight professional FPS players of Rainbow Six Siege5 participated, because it was difcult to recruit CS:GO professional players in the area where the study was conducted.",
  "Instead, we confrmed that and right legs (three bones each).",
  "The enemy’s skeletal data include 5Tom Clancy’s Rainbow Six Siege, Ubisoft, 2015 they have universal professional skills that can be commonly applied to diferent types of FPS games.",
  "In a preliminary survey, the participants in the professional group replied that they were also performing best in Overwatch and PUBG (e.g., grandmasters (top 1%) in Overwatch or listed in the top 100 places in PUBG as a solo).",
  "For the amateur player group, eight players from a local university who recreationally play FPS games participated.",
  "During recruitment, we fltered only those who had sufcient FPS experience using their usual FPS rank; For instance, among those who play Overwatch, we only recruited those who have a higher rank than the gold rank (top 71%).",
  "The average amount of FPS playing time per week was 47 hours (SD = 12.97) for the professional player group and 9.13 hours (SD = 5.77) for the amateur player group.",
  "The average age of the participants was 22.75 years old (SD = 3.37) for the professional player group and 23.5 years old (SD = 3.38) for the amateur player group.",
  "All participants were male and right-handed, and none had previous experience playing CS:GO.",
  "Each participant played a one-on-one match against an opponent player for 30 minutes.",
  "The opponent player was selected within the same group to replicate the real-world play environment and maintain the gameplay comptetitiveness.",
  "In a typical FPS game, players are automatically assigned to other players with a similar performance level.",
  "The goal of the task was to kill the opponent as many times as possible, using only the designated weapons.",
  "The participants were in terrorist group and used a assault rife (the AK-47) for the frst 20 minutes and used a sniper rife (the AWP) for the remaining 10 minutes, while the opponent used a assault rife (M4A4) for 30 minutes.",
  "The map used for gameplay was a conventional workshop map called aim_map6 which is used for one-on-one play.",
  "The map did not include specifc missions, such as bomb planting or rescuing hostages, to keep the goal as simple as possible.",
  "The overview of the map is depicted in Figure 3.",
  "The gameplay logging system we described in Section 3.1 was implemented on a Windows desktop computer (64-bit Windows 10 Pro, Intel Core i7-9800X CPU @ 3.80 GHz, 16 GB RAM with NVIDIA GeForce GTX 2080 Ti).",
  "We used an Alienware 27 gaming monitor with a native resolution of 1920 x 1080 at 240 Hz.",
  "The mousepad was a SteelSeries QcK heavy model measuring 450 mm x 400 mm x 6 mm.",
  "6aim_map, CS:GO Workshop, FREIHH & leplubodeslapin, 2013",
  "The apparatus was installed on a regular desk.",
  "Eight motion-capture cameras were positioned around the desk to capture the 12 markers placed on the keyboard, mousepad, and participant’s body.",
  "We explain the specifc locations of the markers in Section 4.1.2 on motion-capture data labeling.",
  "The participants wore an MYO armband on their right forearm without interfering with the motioncapture markers.",
  "The eye tracker was placed on the bottom side of the monitor.",
  "For each participant, we properly adjusted the monitor height and angle to place the eyes within the tracking feld.",
  "We set the Windows mouse setting to 1000 dpi for all participants, and they adjusted the mouse sensitivity in the game if they desired.",
  "The entire experimental setup is illustrated in Figure 2.",
  "For the experiment, each participant was instructed to sit on a gaming chair in front of the experimental setup.",
  "Because the participants did not have any experience with CS:GO, we allowed 15 minutes of practice to familiarize players with the game basics.",
  "During this period, each participant adjusted the in-game settings, such as the mouse sensitivity, if they desired.",
  "After practice, the participants wore the MYO armband and calibrated the sensor.",
  "The participants then put on seven markers on the designated positions and placed the pulse sensor on the right earlobe.",
  "Next, we adjusted the monitor height and angle to place the participant’s eyes within the eye tracker tracking feld.",
  "The calibration of the eye tracker was performed as the gameplay logging system was initiated.",
  "Before the actual gameplay, we asked the participants to stay calm and still for a minute to measure the their base states of pulse and MYO sensors.",
  "Once the base measurements were complete, the actual gameplay began, and the participants played the game for the next 30 minutes.",
  "We collected 7.3 GB of data in total and 75.9 GB of high-resolution video recordings.",
  "We analyze the obtained dataset to verify the conjectures (Table 1).",
  "More specifcally, we propose quantitative metrics that can verify the conjectures, which are divided into four categories: aiming, character’s movement, physical skills, and device and settings (see Table 3).",
  "This section frst describes the preprocessing of the data, then explains in detail what the proposed metrics are, and explains the data analysis results based on those metrics.",
  "Note that the MannWhitney U test was used to assess the statistical signifcance (p < 0.05) as the data are not normally distributed.",
  "5.1.1 Time synchronization.",
  "Timestamp synchronization was performed by compensating for the physical delays of the six sensors and the software delay of the in-game data logger.",
  "For the dual mouse, analog input keyboard, and pulse sensor, we measured the absolute duration from the physical input until the brightness change of the light-emitting diode (LED) or display.",
  "The duration was recorded using a high-speed camera, the Sony RX100 MK5, with a frame rate of 960 frames per second (FPS).",
  "We calculated the delay by measuring the time diference in the dual-sensor mouse data for the motion capture and EMG sensors.",
  "Moreover, we compared the timestamp for each data point that a specifc event (e.g., the press of a mouse button) was simultaneously logged.",
  "Detailed methods for measuring the delay using each of the sensors with the dual-sensor mouse are explained below.",
  "(1) Dual-sensor mouse: When the user clicks the left mouse button, the display color switches from black to white or vice versa.",
  "We recorded the delay from the deepest click stroke until the brightness change using a high-speed camera.",
  "The average delay measured 38.13 ms (SD = 5.832, N = 20).",
  "We evaluated the same number of tasks for the condition of black to white and white to black.",
  "(2) Analog input keyboard: When the user presses a key, the display color switches from black to white or vice versa.",
  "We recorded the delay from the deepest keystroke until the brightness change using a high-speed camera.",
  "The average delay measured 24.06 ms (SD = 4.07, N = 20).",
  "We evaluated the same number of tasks for the condition of black to white and white to black.",
  "(3) Motion-capture sensor: A marker was attached to the user’s right index fnger tip.",
  "Then, we recorded the marker’s z-axis value (orthogonal to the mouse pad) and the mouse click logs.",
  "We calculated the delay by comparing the timestamps of the moment when z was minimum in the motion-capture data and the moment when the button-press event was logged into the mouse data.",
  "The average delay measured 11.64 ms (SD = 14.77, N = 25).",
  "(4) Eye tracker: We recorded eye images on the iViewRED software interface and the experimenter’s pupil movement in a scene with a high-speed camera.",
  "Then, we measured the delay from the pupil movement until the change in eye images.",
  "The average delay measured 60 ms (SD = 15.47, N = 20).",
  "(5) Electromyography sensor: The user wearing an MYO armband dragged the mouse quickly in the vertical direction from the direction in which the user was sitting.",
  "Since the MYO armband contains an IMU sensor, we could compare the timestamps when each sensor’s acceleration is 0.",
  "The average delay of the IMU sensor from the mouse sensor measured 16.13 ms (SD = 15.57, N = 23).",
  "(6) Pulse sensor: The pulse sensor contains an optical sensor for a heart-rate monitor.",
  "When the sensor detects light, it changes the signal value provided by the pulse sensor.",
  "We placed a pulse sensor attached to an LED light source into a dark box.",
  "Then, we measured the delay from turning the LED on until the brightness change using a high-speed camera.",
  "The average delay measured 45.83 ms (SD = 3.423, N = 5).",
  "(7) In-game data: We compared the timestamps when the weapon fre event was logged in the in-game data and the moment when the left button-press event was logged in the mouse data.",
  "We performed a delay test for 20 shots to compare the delay between the mouse and in-game data with all connected sensors.",
  "The average delay was 23.7 ms (SD = 9.12, N = 20).",
  "5.1.2 Motion-capture data labeling.",
  "We used 12 markers in this experiment, as depicted in Figure 4.",
  "(b): two markers on the top side of the keyboard (4 and 8), two markers on the left hand (5) and wrist (6), three markers on the index fnger of the right hand (9, 10, and 11), two markers on the right wrist and the elbow (12 and 7), and three markers attached to each corner of the mouse pad (1, 2, and 3), except for the lower left part to avoid interfering with the player’s arm movement.",
  "We labeled the markers based on their size and location for each frame during the game.",
  "We put the largest markers (1, 2, 3, 4, and 8) on the keyboard and mouse pad, and the medium-sized markers (5, 6, 7, and 12) on the left hand, right wrist, and right elbow.",
  "The smallest three markers (9, 10, and 11) were attached to the right index fnger.",
  "We frst classifed the two left-most two of the largest markers as keyboard markers (4 and 8), and the three right-most markers as mouse pad markers (1, 2, and 3).",
  "The two medium-sized markers on the left half were labeled with the left wrist and hand (6 and 5) in order by proximity to the body.",
  "Finally, the medium and smallest markers on the right half were labeled with the right elbow, wrist, and index fnger in order by proximity to the body.",
  "We only labeled frames with all 12 markers present and the frames during the gameplay.",
  "5.1.3 Electromyography data normalization and filtering.",
  "The signal from the MYO band contains noise and may appear diferently depending on various factors, such as the participant’s hair, fatty tissue, or sweat.",
  "Hence, we performed two types of preprocessing, which are common operations conducted before analyzing the EMG data: normalizing and fltering.",
  "First, we normalized the data from the eight sensors to a range from -1 to 1.",
  "Then, the Gaussian kernel flter (siдma=3) was used to remove the noise.",
  "5.1.4 Classification of combat process.",
  "Regarding submovement segmentation, according to the adaptive model theory, all voluntary continuous movements performed by a human, such as a tracking task, comprise a concatenated sequence of submovements.",
  "In our study, we used a mouse speed profle to segment the player movement into submovements.",
  "The speed profle was obtained in units of pixels per milliseconds by dividing the cursor dx and dy by dt .",
  "Because noise generated from sensing hardware reduces the accuracy or precision of a signal, we used a Gaussian kernel fler (σ =3) to reduce the noise.",
  "As the local minimum point of the speed profle is considered the boundary separating submovements, we used the findpeaks function of MATLAB to determine the local maximum points of the inverted speed function.",
  "Then, we found the last minimum point right before the shooting as presented in Figure 4.",
  "(a).",
  "Regarding shooting, during gameplay, a player typically repeats a sequence of actions, including shooting a weapon.",
  "Using the weapon fre events, we grouped a sequence of fring events into one shooting chunk if the interval between the weapon fre events is shorter than 1000ms.",
  "When we plotted the histogram of the intervals between ’weapon fre’ events, we found out that most were distributed within 1000 ms.",
  "Thus, we empirically chose the time window to 1000 ms.",
  "If the interval is longer than 1000ms, we defned it as an event in the subsequent shooting chunk.",
  "We logged the data from 1097 rounds of the game, and the total playtime for 16 participants at 30 minutes each was 480 minutes.",
  "During the 30 minutes, the number of efective shots generated by the professional players was 158.63 (SD = 14.52) on average, and was 142.44 (SD = 13.64) for the amateur players.",
  "Even with the same amount of time, professional players generated more efective shots than amateur players (p = 0.03).",
  "In addition, the two groups exhibited diferences in reaction time for shooting, which is the time interval from the enemy’s appearance to the frst shooting when using a sniper rife (p = 0.02).",
  "The average reaction times for the professional and amateur groups were 459.54 ms and 504.36 ms, respectively.",
  "When using the assault rife, no signifcant diference was found in the reaction time between the two groups.",
  "The two groups did not exhibit any signifcant diference in KDR because the opponent player was selected within the group to replicate the real-world play environment.",
  "For example, in Overwatch, the average KDR of the top 50 players in the Grandmaster tier is 2.72 (SD = 0.44), and the average KDR of the top 50 in the platinum tier is 2.65 (SD = 0.55), which is not signifcantly diferent.",
  "In our experiment, the average KDR was 1.47 (SD = 0.92) for the professional player and 1.14 (SD = 0.79) for the amateur player group.",
  "Regarding the aiming skills of FPS players, this study proposes fve general metrics: (1) enemy-crosshair stickiness, (2) angular velocity of the mouse, (3) amplitude of the recoil compensating movement, (4) duration of shooting, and (5) force inefciency.",
  "This section describes each metric in detail and presents the analysis results of each metric.",
  "5.3.1 Enemy-Crosshair Stickiness.",
  "Tracking is an aiming style that keeps the enemy’s position in the middle of the crosshair.",
  "It is one of the skills used with guns that are fred continuously, such as the AK-47 of M4-A4.",
  "It becomes easier to shoot the enemy quickly and consistently with a closer distance between the enemy’s location and the player’s crosshair.",
  "To compare players’ tracking performance, we calculated the average distance between the center of the player’s crosshair and the enemy’s head and body location.",
  "5.3.2 Angular Velocity of Mouse.",
  "The ficking aim is another aiming style that snaps the wrist to move the crosshair to the enemy’s position.",
  "If the enemy is moving erratically, it is difcult to accurately follow their position with tracking aim.",
  "Hence, the player must quickly move the crosshair and hit the moving target before the opponent can react.",
  "In general, as the plan for how to click on the target occurs in the last submovement, we assumed that the plan for how to shoot the opponent and how to move the mouse or crosshair for the shooting would also take place in the last submovement.",
  "We calculated the average angular velocity of the mouse (ωmouse ) during the last submovement to measure the degree of wrist snapping, which can be calculated as follows: dθ dXf ront − dXr ear ωmouse = = d( )/dt",
  "dt rmouse where dXf ront and dXr ear are the dx logged from the front and rear sensors of the mouse.",
  "In addition, rmouse is the distance between the two sensors, 72 mm in our experiment.",
  "5.3.3 Amplitude of the recoil compensating movement.",
  "In general, most assault rifes used in FPS games have recoil, and some guns have their own patterns.",
  "However, for most guns, the muzzle moves upwards if a player keeps fring, similar to the movement in a realistic situation.",
  "Therefore, some have conjectured that players must move the mouse in the opposite direction of the weapon’s recoil to compensate for the kicks during shooting.",
  "To compare the amplitude of the recoil compensating movement, we measured the average dy of the mouse during shooting.",
  "5.3.4 Duration of shooting.",
  "There are two main methods exist to shoot a weapon: tapping and spraying.",
  "Tapping is a single or short burst of controlled weapon fre using discrete mouse clicks.",
  "In contrast, spraying is a stacked or a more extended period of weapon fre typically done by continuously pressing the mouse.",
  "To measure the two types of shooting, we calculated the average time intervals of individual mouse clicks.",
  "A single mouse click interval was measured to be the time between pressing and releasing the mouse.",
  "A shorter interval is closer to tapping, ans a longer interval is closer to spraying.",
  "5.3.5 Force ineficiency.",
  "In FPS games, the mouse sensitivity is a crucial factors that afects aiming.",
  "According to some conjectures, professional players have their own optimal mouse sensitivity, and amateur players have also tried to discover this.",
  "After the setting a specifc sensitivity, players practice learning movements that ft the sensitivity.",
  "Players who are well trained and accustomed to their sensitivity can move the mouse exactly where they desire at once.",
  "To measure how familiar the players are with their mouse sensitivity settings, we calculated the force inefciency by counting the number of the zero crossings in a mouse’s acceleration function for 460.48 ms before shooting.",
  "We set the interval to 460.48 ms because the players fred the weapon 460.48 ms on average after the enemy appeared.",
  "5.3.6 Results.",
  "Unlike our expectations, when shooting and tracking the target (A-1), the average distance between the target’s head and player’s crosshair for professional players was farther than that for the amateur players.",
  "The average distances for the professional and amateur players were 22.56 px and 16.19 px, respectively.",
  "Before shooting, both groups aimed at a similar distance from the target at 64.89 px and 72.06 px.",
  "In this regard, by comparing the amplitude of the recoil compensation (A-3), we found that professional players tend to drag the mouse down more than amateur players during shooting.",
  "The professional and amateur players dragged the mouse down an average of 190.81 px and 62.48 px, respectively.",
  "We also found that professional players exhibit faster angular velocity (A-2) for both cases with assault rifes (0.03 rad/ms) and sniper rifes (0.05 rad/ms) compared to amateur players at 0.01 rad/ms for assault rifes and 0.03 rad/ms for sniper rifes.",
  "However, the angular velocity multiplied by the mouse sensitivity for each player demonstrated no signifcant diference.",
  "The professional players’ mouse movement was more efcient in terms of force efciency (A-5).",
  "The force inefciency of professional players is 2.73, which means that professional players changed the moving direction of the mouse less than amateur players at 2.97.",
  "In addition, the shooting duration was 190.81 ms and 62.48 ms for the professional and the amateur groups, respectively.",
  "The professional players displayed a relatively close duration to the spraying shooting.",
  "5.3.7 Discussion.",
  "Several interesting points were found in the results for aiming.",
  "First, contrary to the conjectures, the enemycrosshair stickiness during the shooting was shorter for amateur players, which is because professional players dragged the crosshair 128.33 px farther down to compensate for gun recoil, whereas amateur players did not.",
  "For nonshooting situations, where the recoil compensation is unnecessary, two groups did not exhibit a significant diference in the enemy-crosshair stickiness.",
  "In CS:GO, the center of the crosshair and the coordinates of the fred bullet are slightly diferent due to the recoil of the gun.",
  "Although we could not locate the exact trajectory of the fred bullets from the in-game data, the recoil makes the bullets spatter to higher positions than the crosshair center.",
  "Because this is a CS:GO game-dependent feature, further verifcation of the metric is needed using another game.",
  "Second, a signifcant diference in the angular mouse velocity was found between the two groups, which can be a clue concerning ficking aims.",
  "However, when we compensated for the mouse sensitivity, the angular mouse velocity was not signifcant, as shown in the A-2 in Table 3.",
  "Therefore, the crosshair movement speed in the game was similar in both groups, but, in reality, professional players move the mouse with a higher angular speed than amateur players.",
  "Professional players use a lower sensitivity because it allows the player to control movements more precisely.",
  "In other words, they can move the same distance with a higher resolution.",
  "In our experiment, this was verifed through professional players using a wider area of the mouse pad by 1006 cm2 than amateur players (D-1 in Table 3).",
  "Third, professional players demonstrated less force inefciency when using sniper rifes, which means that professional players switched the mouse direction less often than amateur players to aim at an enemy because they did not need corrective movements.",
  "Typically, players who are more trained and familiar with the mouse sensitivity can aim at the desired position at once without the corrective movements, because they tend not to undershoot or overshoot.",
  "From the results, professional players are more capable than amateur players in fnding suitable sensitivities.",
  "However, no signifcant diference was found when using the assault rife.",
  "In general, mouse sensitivity is considered more important when using a ficking aims, but assault rife usage requires more tracking aim than ficking aim.",
  "We proposes three metrics for the character’s movement: (1) entropy of combinations of keys, (2) frequency of movement combinations for accurate aiming, and (3) reload efciency.",
  "Details for each metric and results are provided below.",
  "5.4.1 Entropy of combinations of keys.",
  "In FPS games, neutralizing an enemy’s attack is just as important as killing an enemy.",
  "To do so, players must make dynamic and unpredictable movements employing various combinations of keys.",
  "To measure the random combinations of keys, we calculated the entropy based on compression algorithms, a widely used approach in calculating the entropy of a symbolic sequence.",
  "The algorithm states that symbolic sequence entropy can be estimated by fnding the shortest mismatch in the sequence, which can be compressed without information loss.",
  "5.4.2 Frequency of movement combinations for accurate aiming.",
  "Moving while shooting signifcantly reduces aiming accuracy.",
  "Therefore, professional players often make stuttering idesteps, crouch, or walk right before shooting to stabilize the aiming.",
  "We measured two types of movement combinations for stabilizing the aiming suggested by the community: stuttering side steps and a crouching pattern while moving.",
  "For stuttering side steps, we measured the frequency of the key combinations A-D-A (left-right-left) or D-A-D (right-left-right).",
  "For crouching, we measured the frequency of combinations of each movement keys (A, S, D, and W) and the crouching key (Ctrl).",
  "We counted the combinations of each movement from the shortest sequence patterns extracted from the Lempel-Ziv compression algorithm to obtain the two frequencies.",
  "5.4.3 Reload Eficiency.",
  "The gun magazine bullets are limited in FPS games so that the players must reload when the bullets runs out.",
  "Because players cannot shoot while loading, players are in a dangerous situation if they encounter an opponent while loading.",
  "The conjecture suggests that professional players do not reload habitually and know the right time to reload.",
  "To measure the reload efciency, we counted the number of bullets left when the player reloads.",
  "5.4.4 Results.",
  "Regarding the character movement, the two groups exhibited a signifcant diference in the entropy of the pressed keys (M-1) and the number of combinations that presses the crouching key right before shooting (M-2).",
  "The average entropy for professional players was 1.51, which means that the specifc movement combination pattern was repeated many times compared to the amateur players (M = 1.63).",
  "The professional players used crouching combinations more often than amateur players (p = 0.03).",
  "Nevertheless, the number of stuttering combinations and the reload efciency (M-3) exhibited no signifcant diference.",
  "5.4.5 Discussion.",
  "In an FPS game, dodging the opponent’s bullets is as vital as aiming accurately.",
  "Therefore, many communities recommend moving randomly so that the opponent cannot anticipate the movements.",
  "According to the entropy calculation for the M-1 conjecture, a lower entropy value indicates a higher compression rate for the key sequences, resulting from a higher repetition of specifc movement patterns.",
  "Thus, the lower entropy of the professional players means that their movements are more predictable than those of amateur players.",
  "In other words, more similar patterns were observed in the movement sequence of the professional players.",
  "The analysis results of the frequency of movement combinations for accurate aiming indicate that professional players tend to mix crouching in the middle of their movements more often (p = 0.03), yet making a similar level of stuttering steps compared to the amateur players.",
  "Crouching right before shooting is a habit recommended by many skillful players because it lowers the chance of a headshot from the opponent and, increases the player’s shootnig accuracy resulting in more efective shots.",
  "Moreover, more frequent generation of the same movement patterns, such as crouching before shooting, may explain the lower entropy of the professional players’ in the previous observation.",
  "For the physical skills, we proposes four general metrics: (1) rotation ratio of elbow and wrist, (2) arm electromyography (EMG) activity, (3) duration of fxation and the number of saccades, and (4) composure.",
  "Details for each metric and results are provided below.",
  "5.5.1 Rotation ratio of elbow and wrist.",
  "There are two primary methods exist to aim: arm and wrist aiming.",
  "Wrist aiming using delicate muscles allows the player to control the mouse more fnely.",
  "However, according to conjecture, most professional players primarily use their arms to aim because, assuming the players use the same sensitivity, arm aiming is advantageous for quickly dragging the mouse to a distant location at once and puts less strain on the muscles.",
  "To measure the arm and wrist usage proportion, we calculated the elbow rotation angle (the horizontal vector of the desk to the lower arm) and wrist (lower arm to hand).",
  "Then, we compared the elbow and wrist rotation ratio by dividing the rotation angle of the wrist by elbow rotation angle.",
  "5.5.2 Arm Electromyography (EMG) Activity.",
  "The conjecture suggests building muscle memory in the arm and wrist to aim precisely.",
  "Traditionally, the term ’muscle memory’ has been used by FPS players as a synonym for motor learning, which is the acquisition of motor skills to enhance performance.",
  "We analyzed the EMG to measure the magnitude of muscle activation of the arm and wrist and compared the magnitude of muscle activation when shooting and not shooting.",
  "5.5.3 Duration of fixation and the number of saccades.",
  "Eye movement tracking data are commonly used to measure the system usability or user profciency.",
  "Fixation and saccades are essential metrics for eye movement data analysis.",
  "Among several methods, we used a robust and highly accurate method, dispersionthreshold identifcation (I-DT), to separate and label the fxation and saccades.",
  "The I-DT method requires two thresholds: the duration and dispersion thresholds.",
  "Typically, the fxation duration is at least 100 ms; thus in the dispersion-based identifcation technique, the minimum duration threshold is set as 100 ms to 200 ms.",
  "Regarding the dispersion threshold, if we know the distance from the eye to the screen, the dispersion threshold can be set to cover 1/2◦ to 1◦ of the viewing angle.",
  "In our experiment, the distance between the monitor and user was about 400 mm.",
  "Therefore, we set the duration threshold at 200 ms and the dispersion threshold as 13.20 px (3.49 mm).",
  "We divided the situation into when the enemy was visible and invisible and calculated the fxation duration and the number of saccades.",
  "5.5.4 Composure.",
  "During the FPS play, it is essential to maintain composure.",
  "Especially in urgent situations, such as encountering an enemy, shooting at an enemy, or having low health points, a more composed player has a higher chance of survival.",
  "We calculated the player’s composure using three measurements, average heartbeat, average inter-beat interval, and average pupil diameter.",
  "Each measurement was calculated for a specifc game situation, where a player’s health points were lower than 30.",
  "Because the sensor’s absolute magnitude for each participant varies, we calculated the sensor measurement ratio, with fewer than 30 health points and more than 30 over health points.",
  "5.5.5 Results.",
  "In the physical skills category, the elbow and wrist rotation ration exhibited a signifcant diference (p = 0.04).",
  "The professional players’ rotation ratio was 2.95, which demonstrates that the elbow rotation angle is about three times larger than that of the wrist.",
  "In contrast, the rotation ratio for amateur players wa 1.22, which means the amateur players used their wrists and arms in a similar proportions.",
  "When the enemy was invisible, the two groups demonstrated a signifcant diference in the fxation duration (p < 0.01) at 559.73 ms for professional players and 321.09 ms for amateur players.",
  "The professional players had a 238.64 ms longer duration than the amateur players, but the number of saccades was similar.",
  "No signifcant diference was found for both the fxation duration and number of the saccades in the visible situation.",
  "The muscle activity of the lower arm (P-2) measured by the MYO band was not signifcantly diferent for shooting and non shooting situations.",
  "Moreover, they maintained a constant number of BPM, regardless of the number of health points remaining.",
  "Likewise, no signifcant diferences in the inter-beat interval and pupil diameter were found (P-4).",
  "5.5.6 Discussion.",
  "By comparing the elbow and wrist rotation ratio, we found that the professional players tend to use arm rotation more than wrist rotation when aiming, verifying the conjecture P-1.",
  "However, both groups had similar levels of muscle activation when shooting and not shooting.",
  "According to the fxation duration, professional players stared at a specifc position longer when the enemy was invisible.",
  "However, the conjecture recommends looking around as quickly and as much as possible, contrary to the fndings.",
  "For composure, we could not fnd any signifcant diference in the metrics.",
  "We summarize the following two reasons for such results: the small map size and the diferent experimental environment than the actual competition.",
  "First, the map in this experiment was small and straightforward, so it was relatively easy to locate the opponent, which means that the player did not need to scan their surroundings diligently to fnd the enemy.",
  "In the post-experiment survey, some participants answered that it was easier to predict where the enemy would appear than in the actual game.",
  "In addition, because the experiment did not generate psychological pressure comparable to the real competition, we presume no fuctuations occurred in the players’ composure.",
  "Regarding the metrics on device and settings, we proposes two metrics: (1) used area of mousepad and (2) keyboard perpendicularity.",
  "Details for each metric and results are provided below.",
  "5.6.1 Used Area of Mousepad.",
  "The DPI and in-game sensitivity are measurements of mouse sensitivity.",
  "Using low sensitivity means the player can move the same distance with a higher resolution when using the mouse in the game.",
  "Hence, low sensitivity ofers an advantage to accurate and precise aiming, and most professional players used low sensitivity.",
  "Because it is recommended to use the mouse pad widely with low sensitivity, we compare the square measure of the used mousepad area.",
  "The square measure was calculated using the maximum and minimum x and y values of the right index fnger tip.",
  "5.6.2 Keyboard Perpendicularity.",
  "It is inevitable to use the keyboard in the same posture for a long time when playing FPS games.",
  "However, the wrist fexion or extension angle and radial and ulnar deviation angle afect carpal tunnel pressure.",
  "Several communities have advised placing the keyboard perpendicular to the player’s sitting direction due to stress on the wrist.",
  "We calculated an angle between the keyboard and the horizontal vector to the desk, which is assumed to be the player’s sitting direction.",
  "5.6.3 Results.",
  "The total used area of the mousepad (D-1) and the perpendicularity of the keyboard (D-2) displayed signifcant differences between the two groups.",
  "The average sensitivity of the professional players was 0.91 (SD = 0.25) for a assault rife and 0.99 (SD = 0.27) for a sniper rife.",
  "Amateur players set the sensitivity to 2.03 (SD = 0.85) for a assault rife and 2.10 (SD = 0.27) for a sniper rife.",
  "These values were higher than those for the professional players.",
  "Professional players used an area of 1479 cm2 on average, and the amateur players used an area of 473 cm2.",
  "The keyboard of professional players was placed at 18.32◦ from the horizontal direction of the desk, whereas the amateur players placed it at 2.85◦.",
  "5.6.4 Discussion.",
  "Most professional players used lower sensitivities than the amateur players, which also resulted in using a larger mousepad area, as indicated in the result for D-1.",
  "Therefore, we confrm the suggestions from many communities to lower the sensitivity and use a larger mouse pad to increase aiming accuracy.",
  "The results also confrmed that professional players tend to use the keyboard at a larger angle.",
  "In the post-experiment survey, participants answered questions asked about the commonalities and diferences between their usual FPS game and the experiment they conducted, and what they had considered most crucial to win the game.",
  "Both amateur and professional players responded that the aiming method was similar because the rifes used in the experiment are familiar.",
  "They also responded that the map structure and the presence of recoil on the rifes were similar to the actual game.",
  "In particular, 5 out of 8 professional players mentioned that they had to react quickly to the opponent’s movements like in the actual FPS game.",
  "For the diference, the two groups replied that the rifes in CS:GO had a greater recoil amplitude than the weapons in other games.",
  "Because of this feature, the players had to stop moving before shooting.",
  "In addition, professional players responded that it was awkward that they could not use their own equipment, such as a mouse or keyboard.",
  "Lastly, professional players pointed out the four most important strategies to win the game: adapting to mouse sensitivity, ficking accurately, predicting the opponent’s position, and compensating for the recoil.",
  "Among them, interestingly, adapting to mouse sensitivity and compensating the recoil were matched to the A-4 and A-3, which exhibited statistically signifcant diference.",
  "This study quantitatively verifed and statically examine conjectures on FPS performance from online communities.",
  "We developed a comprehensive gameplay logging system and collected a dataset from professional and amateur players playing the commercial FPS CS:GO.",
  "We confrmed the conjectures A-3, A-4, M-2, P-1, D-1, and D-2 to be meaningful by analyzing the collected data.",
  "Although A-1, A-2, M-1, and P-3 were statistically signifcant, we withheld confrmation because they were either partially verifed or went against the conjectures.",
  "In more detail, the combat skills of professional players we found in the experiment can be summarized as follows: while shooting using a assault rife, professional players tended to lower the crosshairs downwards with a greater amplitude than amateur players did to compensate for recoil.",
  "Also, professional players showed lower force inefciency than amateur players when using sniper rifes.",
  "This means that professional players were more familiar with their sensitivity and needed less corrective movement to aim accurately.",
  "By comparing the rotation ratio of the elbow against the wrist, we found out that professional players used more elbows than the wrist during aiming, and the professional players’ rotation ratio was higher than the amateurs’.",
  "For character movement, professional players showed a pattern of crouching just before shooting more frequently than amateur players.",
  "During the experiment, professional players used a larger area of the mousepad than amateur players and placed the keyboard more vertically.",
  "This study also reveals two interesting points about the origin of the high performance of professional players.",
  "First, it seems that the combat strategy of professional players is largely determined by the settings of the game interface such as the input device.",
  "For example, looking at the results of the A-2 related metrics, the reason professional players move their mouse faster than regular players may simply be because they have a lower mouse sensitivity setting.",
  "Further research is needed on whether the behavior of professional players will signifcantly difer from those of amateur players even in the same interface setting.",
  "Second, from the fact that professional players showed lower reaction times than amateur players during the gameplay, we can infer that the high performance of professional players may be due to their innate cognitive ability.",
  "This is related to the issue of whether there is a diference in innate talent among individuals that cannot be overcome by training in e-sports.",
  "This hypothesis could be tested in the future through controlled lab experiments using cognitive tasks related to FPS gameplay, such as pointing, choice-reaction, temporal pointing, and moving-target acquisition However, this study has some obvious limitations in terms of external validity and generalizability, which should be supplemented by further studies in the future.",
  "First, the players recruited in this study did not have the experience of playing CS:GO, the FPS game used in the experiment.",
  "Although we recruited players who are believed to have universal skills that can be applied to various FPS games and also gave them enough time to practice during the experiment, this could have led to lower statistical power in this study, considering that professional players generally spend much longer training their main games.",
  "Second, due to the peculiarity of CS:GO, the FPS game used in this study, the fndings in this study may not be able to generalize to other FPS games.",
  "For example, as discussed earlier, the fact that the crosshair and bullet trajectory not being completely matched in the game can infuence the conjecture A-1.",
  "However, the performance metrics we have proposed do not depend on the type of FPS game, so if research on other FPS games based on the same metrics is carried out later, the limitation could be supplemented.",
  "The controlled experimental setup also presented several limitations.",
  "First, professional players are typically keen about using their own equipment, such as the mouse and keyboard; however, we had to provide a special mouse and keyboard to log behavioral data.",
  "Second, although we used small motion-capture markers and ear-clip type pulse sensor instead of the fnger-clip type, the sensors may have afected to the participants’ movement.",
  "Third, gameplay’s restricted circumstances, such as a small map and one on one fght, only required simplistic movements.",
  "Fourth, the experiment in the lab could not generate sufcient immersion similar to real gameplay for the players to exhibit psychological changes, such as BPM or pupil diameter.",
  "Finally, this study did not fully consider the fact that many FPS games assume multiplayer settings.",
  "In a multiplayer setting, a team’s success is afected not only by the individual player’s combat skills, but also by how well players communicate with each other.",
  "In the future, a more generalized experiment addressing these limitations may increase the external validity."
]